-- phpMyAdmin SQL Dump
-- version 4.6.5.2
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Июл 05 2018 г., 13:57
-- Версия сервера: 5.7.16-log
-- Версия PHP: 7.0.14

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `test_task`
--

-- --------------------------------------------------------

--
-- Структура таблицы `useCase`
--

CREATE TABLE `useCase` (
  `id` int(10) UNSIGNED NOT NULL,
  `name_case` varchar(15) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `id_u` int(10) UNSIGNED DEFAULT NULL,
  `time_case` datetime DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `useCase`
--

INSERT INTO `useCase` (`id`, `name_case`, `id_u`, `time_case`) VALUES
(1, 'вход', 1, '2018-07-04 09:04:06'),
(2, 'редактирование', 1, '2018-07-04 09:30:00'),
(3, 'выход', 1, '2018-07-04 10:00:00'),
(4, 'вход', 2, '2018-07-04 05:00:00'),
(5, 'просмотр', 2, '2018-07-04 05:05:00'),
(6, 'редактирование', 2, '2018-07-04 05:17:07'),
(7, 'выход', 2, '2018-07-04 05:28:00'),
(8, 'вход', 3, '2018-07-04 00:04:00'),
(9, 'выход', 3, '2018-07-04 00:12:00'),
(10, 'вход', 4, '2018-07-04 03:06:00'),
(11, 'публикация', 4, '2018-07-04 03:23:07'),
(12, 'выход', 4, '2018-07-04 03:42:08'),
(13, 'вход', 5, '2018-07-04 07:06:05'),
(14, 'удаление', 5, '2018-07-04 07:19:05'),
(15, 'выход', 5, '2018-07-04 07:30:00'),
(16, 'вход', 6, '2017-07-03 10:00:00'),
(17, 'публикация', 6, '2017-07-03 10:10:00'),
(18, 'публикация', 6, '2017-07-03 10:20:00'),
(19, 'выход', 6, '2017-07-03 10:22:00'),
(20, 'вход', 7, '2017-07-08 11:09:00'),
(21, 'редактирование', 7, '2017-07-08 11:10:00'),
(22, 'редактирование', 7, '2017-07-08 11:15:00'),
(23, 'выход', 7, '2017-07-08 11:18:00'),
(24, 'вход', 8, '2017-07-22 12:00:00'),
(25, 'просмотр', 8, '2017-07-22 12:05:00'),
(26, 'редактирование', 8, '2017-07-22 12:15:00'),
(27, 'выход', 8, '2017-07-22 12:25:00'),
(28, 'вход', 9, '2017-08-21 13:05:00'),
(29, 'просмотр', 9, '2017-08-21 13:07:00'),
(30, 'редактирование', 9, '2017-08-21 13:10:00'),
(31, 'просмотр', 9, '2017-08-21 13:11:00'),
(32, 'публикация', 9, '2017-08-21 13:15:00'),
(33, 'выход', 9, '2017-08-21 13:18:00'),
(34, 'вход', 10, '2017-07-16 14:00:00'),
(35, 'редактирование', 10, '2017-07-16 14:05:00'),
(36, 'редактирование', 10, '2017-07-16 14:10:00'),
(37, 'публикация', 10, '2017-07-16 14:18:00'),
(38, 'просмотр', 10, '2017-07-16 14:22:00'),
(39, 'выход', 10, '2017-07-16 14:27:02'),
(40, 'вход', 1, '2018-07-04 10:10:00'),
(41, 'выход', 1, '2018-07-04 10:15:00'),
(42, 'вход', 2, '2018-07-04 05:30:00'),
(43, 'просмотр', 2, '2018-07-04 05:32:00'),
(44, 'выход', 2, '2018-07-04 05:38:00');

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `id` int(10) UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `last_name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `patronymic` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `gender` char(2) CHARACTER SET utf32 COLLATE utf32_unicode_ci NOT NULL,
  `birthday` date NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`id`, `name`, `last_name`, `patronymic`, `gender`, `birthday`) VALUES
(1, 'Виктор', 'Петров', 'Семенович', 'М', '2000-07-08'),
(2, 'Игорь', 'Семенов', 'Анатольевич', 'М', '1990-07-25'),
(3, 'Илья', 'Попов', 'Антонович', 'М', '1985-05-19'),
(4, 'Павел', 'Усков', 'Андреевич', 'М', '1990-03-23'),
(5, 'Анна', 'Петрова', 'Петровна', 'Ж', '1998-03-18'),
(6, 'Аннастасия', 'Гончарова', 'Анатольевна', 'Ж', '1980-07-09'),
(7, 'Евгения', 'Петрова', 'Андреевна', 'Ж', '1975-03-18'),
(8, 'Виолета', 'Круглова', 'Семеновна', 'Ж', '1984-07-01'),
(9, 'Екатерина', 'Жилова', 'Екатериновна', 'Ж', '1988-12-20'),
(10, 'Надежка', 'Жилинская', 'Антоновна', 'Ж', '1985-12-20');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `useCase`
--
ALTER TABLE `useCase`
  ADD PRIMARY KEY (`id`),
  ADD KEY `id_u` (`id_u`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `useCase`
--
ALTER TABLE `useCase`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=45;
--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;
--
-- Ограничения внешнего ключа сохраненных таблиц
--

--
-- Ограничения внешнего ключа таблицы `useCase`
--
ALTER TABLE `useCase`
  ADD CONSTRAINT `usecase_ibfk_1` FOREIGN KEY (`id_u`) REFERENCES `users` (`id`);

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
